<a href="https://colab.research.google.com/github/romanowiczadam/ml_course/blob/master/03_feature_extraction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

3.1_Import_bibliotek

In [ ]:
import numpy as np
import pandas as pd
import sklearn

sklearn.__version__

'0.22.2.post1'

3.2_Za≈Çadowanie_danych

In [ ]:
def fetch_financial_data(company = 'AMZN'):
    import pandas_datareader.data as web
    return web.DataReader(name = company, data_source = 'stooq')

df_raw = fetch_financial_data()
df_raw.head()

               Open       High        Low    Close   Volume
Date
2020-06-15  2526.60  2584.0000  2508.0001  2572.68  3873335
2020-06-12  2601.21  2621.4766  2503.3500  2545.02  5436127
2020-06-11  2603.50  2671.3800  2536.2300  2557.96  5800107
2020-06-10  2645.00  2722.3500  2626.2600  2647.45  4946031
2020-06-09  2529.44  2626.4300  2525.0000  2600.86  5175950

3.3_Utworzenie_kopii_danych

In [ ]:
df_r = df_raw.copy()
# wycinamy 5 pierwszych wierszy na nasze potrzeby
df_r = df_r[:5]
df_r.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2020-06-15 to 2020-06-09
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    5 non-null      float64
 1   High    5 non-null      float64
 2   Low     5 non-null      float64
 3   Close   5 non-null      float64
 4   Volume  5 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 240.0 bytes

3.4_Generowanienowych zmiennych

In [ ]:
df_r.index.day

Int64Index([15, 12, 11, 10, 9], dtype='int64', name='Date')

In [ ]:
df_r['day'] = df_r.index.day
df_r['month'] = df_r.index.month
df_r['year'] = df_r.index.year
df_r

               Open       High        Low    Close  ...  day  mounth  year  month
Date                                                ...
2020-06-15  2526.60  2584.0000  2508.0001  2572.68  ...   15      15  2020      6
2020-06-12  2601.21  2621.4766  2503.3500  2545.02  ...   12      12  2020      6
2020-06-11  2603.50  2671.3800  2536.2300  2557.96  ...   11      11  2020      6
2020-06-10  2645.00  2722.3500  2626.2600  2647.45  ...   10      10  2020      6
2020-06-09  2529.44  2626.4300  2525.0000  2600.86  ...    9       9  2020      6

[5 rows x 9 columns]

3.5_Dyskretyzacja_danej_ciƒÖg≈Çej

In [ ]:
df_2 = pd.DataFrame(data = {'height' : [175.2, 175.,185., 191., 184., 200.2, 168.8]})
df_2

   height
0   175.2
1   175.0
2   185.0
3   191.0
4   184.0
5   200.2
6   168.8

In [ ]:
df_2['height_cat'] = pd.cut(x=df_2.height, bins=3)
df_2

   height          height_cat
0   175.2  (168.769, 179.267]
1   175.0  (168.769, 179.267]
2   185.0  (179.267, 189.733]
3   191.0    (189.733, 200.2]
4   184.0  (179.267, 189.733]
5   200.2    (189.733, 200.2]
6   168.8  (168.769, 179.267]

In [ ]:
df_2['height_cat'] = pd.cut(x=df_2.height, bins=(160,175,180,205))
df_2

   height  height_cat
0   175.2  (175, 180]
1   175.0  (160, 175]
2   185.0  (180, 205]
3   191.0  (180, 205]
4   184.0  (180, 205]
5   200.2  (180, 205]
6   168.8  (160, 175]

In [ ]:
df_2['height_cat'] = pd.cut(x=df_2.height, bins=(160,175,180,205), labels = ['small', 'medium', 'high'])
df_2

   height height_cat
0   175.2     medium
1   175.0      small
2   185.0       high
3   191.0       high
4   184.0       high
5   200.2       high
6   168.8      small

In [ ]:
pd.get_dummies(df_2, prefix= 'height', drop_first= True)

   height  height_medium  height_high
0   175.2              1            0
1   175.0              0            0
2   185.0              0            1
3   191.0              0            1
4   184.0              0            1
5   200.2              0            1
6   168.8              0            0

3.6_Ekstrakcja_cech

In [ ]:
df_3 = pd.DataFrame(data = {'lang' : [['PL', 'ENG'], ['GER', 'ENG', 'PL', 'FRA'], ['RUS']]})
df_3

                  lang
0            [PL, ENG]
1  [GER, ENG, PL, FRA]
2                [RUS]

In [ ]:
df_3['lang_number'] = df_3['lang'].apply(len)
df_3

                  lang  lang_number
0            [PL, ENG]            2
1  [GER, ENG, PL, FRA]            4
2                [RUS]            1

In [ ]:
df_3['PL_flag'] = df_3['lang'].apply(lambda x:1 if 'PL' in x else 0)
df_3

                  lang  lang_number  PL_flag
0            [PL, ENG]            2        1
1  [GER, ENG, PL, FRA]            4        1
2                [RUS]            1        0

In [ ]:
df_4 = pd.DataFrame(data = {'website' : ['wp.pl', 'onet.pl', 'google.com']})
df_4

      website
0       wp.pl
1     onet.pl
2  google.com

In [ ]:
# podzia≈Ç tekstu metoda str
df_4.website.str.split('.', expand = True)

        0    1
0      wp   pl
1    onet   pl
2  google  com

In [ ]:
new = df_4.website.str.split('.', expand = True)
df_4['portal'] = new[0]
df_4['extension'] = new[1]
df_4

      website  portal extension
0       wp.pl      wp        pl
1     onet.pl    onet        pl
2  google.com  google       com